In [2]:
import pandas as pd 
from sqlalchemy import create_engine, text

In [3]:
pwd

'/Users/christianaosatoamehraymond/Documents/GitHub/seaborn-seeds-student-code/06_interactive_visualizations/daily_project'

In [4]:
df= pd.read_csv('../data/stations.csv',skiprows=17)

In [4]:
df.columns

Index(['STAID', 'STANAME                                 ', 'CN', '      LAT',
       '       LON', 'HGHT'],
      dtype='object')

In [5]:
df.columns = df.columns.str.strip().str.lower()

In [6]:
df['cn']=df['cn'].str.strip()

In [7]:
df

,staid,staname,cn,lat,lon,hght
0,1,VAEXJOE,SE,+56:52:00,+014:48:00,166
1,2,FALUN,SE,+60:37:00,+015:37:00,160
2,3,STENSELE,SE,+65:04:00,+017:09:59,325
3,4,LINKOEPING,SE,+58:24:00,+015:31:59,93
4,5,LINKOEPING-MALMSLAETT,SE,+58:24:00,+015:31:59,93
...,...,...,...,...,...,...
7060,26304,E39 UALAND,NO,+58:32:00,+006:19:32,213
7061,26305,E16 HALLINGBY,NO,+60:16:23,+010:11:11,159
7062,26306,E6 DRIVSTUA,NO,+62:25:37,+009:37:22,697
7063,26307,FV520 SVANDALSFOSSEN,NO,+59:37:28,+006:17:30,18
7064,26308,E6 KVAL,NO,+63:15:29,+010:16:59,13

In [8]:
from dotenv import dotenv_values

config = dotenv_values()

In [9]:
username = config['USER']
password = config['PASS']
host = config['HOST']
port = config['PORT']

In [10]:
url = f'postgresql://{username}:{password}@{host}:{port}/climate'

In [11]:
engine = create_engine(url, echo=False)

In [12]:
with engine.begin() as conn:
    conn.execute(text("DROP TABLE IF EXISTS stations;"))
    conn.execute(text("""
        CREATE TABLE stations (
            staid INT PRIMARY KEY,
            staname VARCHAR,
            cn VARCHAR(2),
            lat VARCHAR,
            lon VARCHAR,
            hght INT
        );
    """))

In [13]:
df.to_sql('stations', engine, if_exists='replace', index=False)

65